app/views/pizzas/index.html.erb

  <h1 style='font-size:1.5rem;margin-top:50px'>Pizza Name:
      <%= pizza.name %> |  Sold by <%= pizza.restaurants.count %> restaurants
---
SELECT COUNT(*) FROM "restaurants" INNER JOIN "restaurant_pizzas" ON "restaurants"."id" = "restaurant_pizzas"."restaurant_id" WHERE "restaurant_pizzas"."pizza_id" = ?  [["pizza_id", 1]]