app/views/restaurants/show.html.erb

    <ul>List of Pizzas:
        <% @restaurant.pizzas.each do |pizza| %>
---
SELECT "pizzas".* FROM "pizzas" INNER JOIN "restaurant_pizzas" ON "pizzas"."id" = "restaurant_pizzas"."pizza_id" WHERE "restaurant_pizzas"."restaurant_id" = ?  [["restaurant_id", 1]]